/*
 * Логічні оператори (&& || !)
 */

//* && - запинається на брехні
//* Якщо операнд був преведенний до false, то повертається значення цього операнду.
//* Якщо всі операнди були приведені до true, то повертається останній.

// const result = 1 && 0 && 'Hello';

// console.log(result);

//* || - запинається на правді
//* Якщо операнд був преведенний до true, то повертається значення цього операнду.
//* Якщо всі операнди були приведені до false, то повертається останній.

// const userName = prompt('Ваше імʼя?') || 'anonymus';

// console.log(userName);

//* ! - інвертує правду до брехні, а брехню до правди

// let isAdult = false;

// console.log(isAdult);

// isAdult = !isAdult;

// console.log(isAdult);
